analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32675/Include/afe_adc_zero_regs.h
#define MXC_F_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_POS       6 /**< SOURCE_VBIAS_MODE Position */
#define MXC_F_AFE_ADC_ZERO_SOURCE_VBIAS_MODE           ((uint8_t)(0x3UL << MXC_F_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_POS)) /**< SOURCE_VBIAS_MODE Mask */
#define MXC_V_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_ACTIVE_MODE ((uint8_t)0x0UL) /**< SOURCE_VBIAS_MODE_ACTIVE_MODE Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_ACTIVE_MODE (MXC_V_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_ACTIVE_MODE << MXC_F_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_POS) /**< SOURCE_VBIAS_MODE_ACTIVE_MODE Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_OUTPUT_IMPEDANCE_125K_OHM ((uint8_t)0x1UL) /**< SOURCE_VBIAS_MODE_OUTPUT_IMPEDANCE_125K_OHM Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_OUTPUT_IMPEDANCE_125K_OHM (MXC_V_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_OUTPUT_IMPEDANCE_125K_OHM << MXC_F_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_POS) /**< SOURCE_VBIAS_MODE_OUTPUT_IMPEDANCE_125K_OHM Setting */
#define MXC_V_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_OUTPUT_IMPEDANCE_20K_OHM ((uint8_t)0x2UL) /**< SOURCE_VBIAS_MODE_OUTPUT_IMPEDANCE_20K_OHM Value */
#define MXC_S_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_OUTPUT_IMPEDANCE_20K_OHM (MXC_V_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_OUTPUT_IMPEDANCE_20K_OHM << MXC_F_AFE_ADC_ZERO_SOURCE_VBIAS_MODE_POS) /**< SOURCE_VBIAS_MODE_OUTPUT_IMPEDANCE_20K_OHM Setting */

/**@} end of group AFE_ADC_ZERO_SOURCE_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_MUX_CTRL0 AFE_ADC_ZERO_MUX_CTRL0
 * @brief    Selects analog inputs for AINP and AINN
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL0_AINN_SEL_POS      0 /**< MUX_CTRL0_AINN_SEL Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL0_AINN_SEL          ((uint8_t)(0xFUL << MXC_F_AFE_ADC_ZERO_MUX_CTRL0_AINN_SEL_POS)) /**< MUX_CTRL0_AINN_SEL Mask */

#define MXC_F_AFE_ADC_ZERO_MUX_CTRL0_AINP_SEL_POS      4 /**< MUX_CTRL0_AINP_SEL Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL0_AINP_SEL          ((uint8_t)(0xFUL << MXC_F_AFE_ADC_ZERO_MUX_CTRL0_AINP_SEL_POS)) /**< MUX_CTRL0_AINP_SEL Mask */

/**@} end of group AFE_ADC_ZERO_MUX_CTRL0_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_MUX_CTRL1 AFE_ADC_ZERO_MUX_CTRL1
 * @brief    Selects excitation current sources and which input they are connected to
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL1_IDAC0_SEL_POS     0 /**< MUX_CTRL1_IDAC0_SEL Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL1_IDAC0_SEL         ((uint8_t)(0xFUL << MXC_F_AFE_ADC_ZERO_MUX_CTRL1_IDAC0_SEL_POS)) /**< MUX_CTRL1_IDAC0_SEL Mask */

#define MXC_F_AFE_ADC_ZERO_MUX_CTRL1_IDAC1_SEL_POS     4 /**< MUX_CTRL1_IDAC1_SEL Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL1_IDAC1_SEL         ((uint8_t)(0xFUL << MXC_F_AFE_ADC_ZERO_MUX_CTRL1_IDAC1_SEL_POS)) /**< MUX_CTRL1_IDAC1_SEL Mask */

/**@} end of group AFE_ADC_ZERO_MUX_CTRL1_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_MUX_CTRL2 AFE_ADC_ZERO_MUX_CTRL2
 * @brief    Connection of VBIAS source to input mux
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_0_POS   0 /**< MUX_CTRL2_VBIAS_SEL_0 Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_0       ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_0_POS)) /**< MUX_CTRL2_VBIAS_SEL_0 Mask */

#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_1_POS   1 /**< MUX_CTRL2_VBIAS_SEL_1 Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_1       ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_1_POS)) /**< MUX_CTRL2_VBIAS_SEL_1 Mask */

#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_2_POS   2 /**< MUX_CTRL2_VBIAS_SEL_2 Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_2       ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_2_POS)) /**< MUX_CTRL2_VBIAS_SEL_2 Mask */

#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_3_POS   3 /**< MUX_CTRL2_VBIAS_SEL_3 Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_3       ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_3_POS)) /**< MUX_CTRL2_VBIAS_SEL_3 Mask */

#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_4_POS   4 /**< MUX_CTRL2_VBIAS_SEL_4 Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_4       ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_4_POS)) /**< MUX_CTRL2_VBIAS_SEL_4 Mask */

#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_5_POS   5 /**< MUX_CTRL2_VBIAS_SEL_5 Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_5       ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_5_POS)) /**< MUX_CTRL2_VBIAS_SEL_5 Mask */

#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_6_POS   6 /**< MUX_CTRL2_VBIAS_SEL_6 Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_6       ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_6_POS)) /**< MUX_CTRL2_VBIAS_SEL_6 Mask */

#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_7_POS   7 /**< MUX_CTRL2_VBIAS_SEL_7 Position */
#define MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_7       ((uint8_t)(0x1UL << MXC_F_AFE_ADC_ZERO_MUX_CTRL2_VBIAS_SEL_7_POS)) /**< MUX_CTRL2_VBIAS_SEL_7 Mask */

/**@} end of group AFE_ADC_ZERO_MUX_CTRL2_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_PGA AFE_ADC_ZERO_PGA
 * @brief    Signal path control of input buffers and PGA
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_PGA_GAIN_POS                0 /**< PGA_GAIN Position */
#define MXC_F_AFE_ADC_ZERO_PGA_GAIN                    ((uint8_t)(0x7UL << MXC_F_AFE_ADC_ZERO_PGA_GAIN_POS)) /**< PGA_GAIN Mask */
#define MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_1X            ((uint8_t)0x0UL) /**< PGA_GAIN_GAIN_1X Value */
#define MXC_S_AFE_ADC_ZERO_PGA_GAIN_GAIN_1X            (MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_1X << MXC_F_AFE_ADC_ZERO_PGA_GAIN_POS) /**< PGA_GAIN_GAIN_1X Setting */
#define MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_2X            ((uint8_t)0x1UL) /**< PGA_GAIN_GAIN_2X Value */
#define MXC_S_AFE_ADC_ZERO_PGA_GAIN_GAIN_2X            (MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_2X << MXC_F_AFE_ADC_ZERO_PGA_GAIN_POS) /**< PGA_GAIN_GAIN_2X Setting */
#define MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_4X            ((uint8_t)0x2UL) /**< PGA_GAIN_GAIN_4X Value */
#define MXC_S_AFE_ADC_ZERO_PGA_GAIN_GAIN_4X            (MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_4X << MXC_F_AFE_ADC_ZERO_PGA_GAIN_POS) /**< PGA_GAIN_GAIN_4X Setting */
#define MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_8X            ((uint8_t)0x3UL) /**< PGA_GAIN_GAIN_8X Value */
#define MXC_S_AFE_ADC_ZERO_PGA_GAIN_GAIN_8X            (MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_8X << MXC_F_AFE_ADC_ZERO_PGA_GAIN_POS) /**< PGA_GAIN_GAIN_8X Setting */
#define MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_16X           ((uint8_t)0x4UL) /**< PGA_GAIN_GAIN_16X Value */
#define MXC_S_AFE_ADC_ZERO_PGA_GAIN_GAIN_16X           (MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_16X << MXC_F_AFE_ADC_ZERO_PGA_GAIN_POS) /**< PGA_GAIN_GAIN_16X Setting */
#define MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_32X           ((uint8_t)0x5UL) /**< PGA_GAIN_GAIN_32X Value */
#define MXC_S_AFE_ADC_ZERO_PGA_GAIN_GAIN_32X           (MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_32X << MXC_F_AFE_ADC_ZERO_PGA_GAIN_POS) /**< PGA_GAIN_GAIN_32X Setting */
#define MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_64X           ((uint8_t)0x6UL) /**< PGA_GAIN_GAIN_64X Value */
#define MXC_S_AFE_ADC_ZERO_PGA_GAIN_GAIN_64X           (MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_64X << MXC_F_AFE_ADC_ZERO_PGA_GAIN_POS) /**< PGA_GAIN_GAIN_64X Setting */
#define MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_128X          ((uint8_t)0x7UL) /**< PGA_GAIN_GAIN_128X Value */
#define MXC_S_AFE_ADC_ZERO_PGA_GAIN_GAIN_128X          (MXC_V_AFE_ADC_ZERO_PGA_GAIN_GAIN_128X << MXC_F_AFE_ADC_ZERO_PGA_GAIN_POS) /**< PGA_GAIN_GAIN_128X Setting */

