analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32675/Include/afe_adc_zero_regs.h
/**@} end of group AFE_ADC_ZERO_SYS_GAIN_B_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SELF_OFF AFE_ADC_ZERO_SELF_OFF
 * @brief    Self-calibration offset value to subtract from conversion results
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SELF_OFF_SELF_OFF_POS       0 /**< SELF_OFF_SELF_OFF Position */
#define MXC_F_AFE_ADC_ZERO_SELF_OFF_SELF_OFF           ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SELF_OFF_SELF_OFF_POS)) /**< SELF_OFF_SELF_OFF Mask */

/**@} end of group AFE_ADC_ZERO_SELF_OFF_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SELF_GAIN_1 AFE_ADC_ZERO_SELF_GAIN_1
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 1
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_1_SELF_GAIN_1_POS 0 /**< SELF_GAIN_1_SELF_GAIN_1 Position */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_1_SELF_GAIN_1     ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SELF_GAIN_1_SELF_GAIN_1_POS)) /**< SELF_GAIN_1_SELF_GAIN_1 Mask */

/**@} end of group AFE_ADC_ZERO_SELF_GAIN_1_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SELF_GAIN_2 AFE_ADC_ZERO_SELF_GAIN_2
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 2
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_2_SELF_GAIN_1_POS 0 /**< SELF_GAIN_2_SELF_GAIN_1 Position */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_2_SELF_GAIN_1     ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SELF_GAIN_2_SELF_GAIN_1_POS)) /**< SELF_GAIN_2_SELF_GAIN_1 Mask */

/**@} end of group AFE_ADC_ZERO_SELF_GAIN_2_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SELF_GAIN_4 AFE_ADC_ZERO_SELF_GAIN_4
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 4
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_4_SELF_GAIN_4_POS 0 /**< SELF_GAIN_4_SELF_GAIN_4 Position */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_4_SELF_GAIN_4     ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SELF_GAIN_4_SELF_GAIN_4_POS)) /**< SELF_GAIN_4_SELF_GAIN_4 Mask */

/**@} end of group AFE_ADC_ZERO_SELF_GAIN_4_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SELF_GAIN_8 AFE_ADC_ZERO_SELF_GAIN_8
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 8
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_8_SELF_GAIN_8_POS 0 /**< SELF_GAIN_8_SELF_GAIN_8 Position */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_8_SELF_GAIN_8     ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SELF_GAIN_8_SELF_GAIN_8_POS)) /**< SELF_GAIN_8_SELF_GAIN_8 Mask */

/**@} end of group AFE_ADC_ZERO_SELF_GAIN_8_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SELF_GAIN_16 AFE_ADC_ZERO_SELF_GAIN_16
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 16
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_16_SELF_GAIN_16_POS 0 /**< SELF_GAIN_16_SELF_GAIN_16 Position */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_16_SELF_GAIN_16   ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SELF_GAIN_16_SELF_GAIN_16_POS)) /**< SELF_GAIN_16_SELF_GAIN_16 Mask */

/**@} end of group AFE_ADC_ZERO_SELF_GAIN_16_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SELF_GAIN_32 AFE_ADC_ZERO_SELF_GAIN_32
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 32
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_32_SELF_GAIN_32_POS 0 /**< SELF_GAIN_32_SELF_GAIN_32 Position */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_32_SELF_GAIN_32   ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SELF_GAIN_32_SELF_GAIN_32_POS)) /**< SELF_GAIN_32_SELF_GAIN_32 Mask */

/**@} end of group AFE_ADC_ZERO_SELF_GAIN_32_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SELF_GAIN_64 AFE_ADC_ZERO_SELF_GAIN_64
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 64
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_64_SELF_GAIN_64_POS 0 /**< SELF_GAIN_64_SELF_GAIN_64 Position */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_64_SELF_GAIN_64   ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SELF_GAIN_64_SELF_GAIN_64_POS)) /**< SELF_GAIN_64_SELF_GAIN_64 Mask */

/**@} end of group AFE_ADC_ZERO_SELF_GAIN_64_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_SELF_GAIN_128 AFE_ADC_ZERO_SELF_GAIN_128
 * @brief    Self-calibration gain value to scale offset corrected conversion results for
 *           gain 128
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_128_LTHRESH0_POS  0 /**< SELF_GAIN_128_LTHRESH0 Position */
#define MXC_F_AFE_ADC_ZERO_SELF_GAIN_128_LTHRESH0      ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_SELF_GAIN_128_LTHRESH0_POS)) /**< SELF_GAIN_128_LTHRESH0 Mask */

/**@} end of group AFE_ADC_ZERO_SELF_GAIN_128_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_LTHRESH0 AFE_ADC_ZERO_LTHRESH0
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_LTHRESH0_LTHRESH_POS        0 /**< LTHRESH0_LTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_LTHRESH0_LTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_LTHRESH0_LTHRESH_POS)) /**< LTHRESH0_LTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_LTHRESH0_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_LTHRESH1 AFE_ADC_ZERO_LTHRESH1
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_LTHRESH1_LTHRESH_POS        0 /**< LTHRESH1_LTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_LTHRESH1_LTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_LTHRESH1_LTHRESH_POS)) /**< LTHRESH1_LTHRESH Mask */

/**@} end of group AFE_ADC_ZERO_LTHRESH1_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_LTHRESH2 AFE_ADC_ZERO_LTHRESH2
 * @brief    Lower comparison threshold for DATA registers
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_LTHRESH2_LTHRESH_POS        0 /**< LTHRESH2_LTHRESH Position */
#define MXC_F_AFE_ADC_ZERO_LTHRESH2_LTHRESH            ((uint32_t)(0xFFFFFFUL << MXC_F_AFE_ADC_ZERO_LTHRESH2_LTHRESH_POS)) /**< LTHRESH2_LTHRESH Mask */

