analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32675/Include/afe_adc_zero_regs.h
/**@} end of group AFE_ADC_ZERO_UC_3_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_4 AFE_ADC_ZERO_UC_4
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_4_REG_DATA_POS           0 /**< UC_4_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_4_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_4_REG_DATA_POS)) /**< UC_4_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_4_REG_ADDR_POS           8 /**< UC_4_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_4_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_4_REG_ADDR_POS)) /**< UC_4_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_4_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_5 AFE_ADC_ZERO_UC_5
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_5_REG_DATA_POS           0 /**< UC_5_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_5_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_5_REG_DATA_POS)) /**< UC_5_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_5_REG_ADDR_POS           8 /**< UC_5_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_5_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_5_REG_ADDR_POS)) /**< UC_5_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_5_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_6 AFE_ADC_ZERO_UC_6
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_6_REG_DATA_POS           0 /**< UC_6_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_6_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_6_REG_DATA_POS)) /**< UC_6_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_6_REG_ADDR_POS           8 /**< UC_6_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_6_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_6_REG_ADDR_POS)) /**< UC_6_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_6_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_7 AFE_ADC_ZERO_UC_7
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_7_REG_DATA_POS           0 /**< UC_7_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_7_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_7_REG_DATA_POS)) /**< UC_7_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_7_REG_ADDR_POS           8 /**< UC_7_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_7_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_7_REG_ADDR_POS)) /**< UC_7_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_7_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_8 AFE_ADC_ZERO_UC_8
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_8_REG_DATA_POS           0 /**< UC_8_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_8_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_8_REG_DATA_POS)) /**< UC_8_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_8_REG_ADDR_POS           8 /**< UC_8_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_8_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_8_REG_ADDR_POS)) /**< UC_8_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_8_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_9 AFE_ADC_ZERO_UC_9
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_9_REG_DATA_POS           0 /**< UC_9_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_9_REG_DATA               ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_9_REG_DATA_POS)) /**< UC_9_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_9_REG_ADDR_POS           8 /**< UC_9_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_9_REG_ADDR               ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_9_REG_ADDR_POS)) /**< UC_9_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_9_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_10 AFE_ADC_ZERO_UC_10
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_10_REG_DATA_POS          0 /**< UC_10_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_10_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_10_REG_DATA_POS)) /**< UC_10_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_10_REG_ADDR_POS          8 /**< UC_10_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_10_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_10_REG_ADDR_POS)) /**< UC_10_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_10_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_11 AFE_ADC_ZERO_UC_11
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_11_REG_DATA_POS          0 /**< UC_11_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_11_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_11_REG_DATA_POS)) /**< UC_11_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_11_REG_ADDR_POS          8 /**< UC_11_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_11_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_11_REG_ADDR_POS)) /**< UC_11_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_11_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_12 AFE_ADC_ZERO_UC_12
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_12_REG_DATA_POS          0 /**< UC_12_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_12_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_12_REG_DATA_POS)) /**< UC_12_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_12_REG_ADDR_POS          8 /**< UC_12_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_12_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_12_REG_ADDR_POS)) /**< UC_12_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_12_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_13 AFE_ADC_ZERO_UC_13
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_13_REG_DATA_POS          0 /**< UC_13_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_13_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_13_REG_DATA_POS)) /**< UC_13_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_13_REG_ADDR_POS          8 /**< UC_13_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_13_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_13_REG_ADDR_POS)) /**< UC_13_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_13_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_14 AFE_ADC_ZERO_UC_14
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_14_REG_DATA_POS          0 /**< UC_14_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_14_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_14_REG_DATA_POS)) /**< UC_14_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_14_REG_ADDR_POS          8 /**< UC_14_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_14_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_14_REG_ADDR_POS)) /**< UC_14_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_14_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_15 AFE_ADC_ZERO_UC_15
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_15_REG_DATA_POS          0 /**< UC_15_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_15_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_15_REG_DATA_POS)) /**< UC_15_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_15_REG_ADDR_POS          8 /**< UC_15_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_15_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_15_REG_ADDR_POS)) /**< UC_15_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_15_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_16 AFE_ADC_ZERO_UC_16
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_16_REG_DATA_POS          0 /**< UC_16_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_16_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_16_REG_DATA_POS)) /**< UC_16_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_16_REG_ADDR_POS          8 /**< UC_16_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_16_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_16_REG_ADDR_POS)) /**< UC_16_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_16_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_17 AFE_ADC_ZERO_UC_17
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_17_REG_DATA_POS          0 /**< UC_17_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_17_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_17_REG_DATA_POS)) /**< UC_17_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_17_REG_ADDR_POS          8 /**< UC_17_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_17_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_17_REG_ADDR_POS)) /**< UC_17_REG_ADDR Mask */

