analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32675/Include/afe_adc_zero_regs.h
/**@} end of group AFE_ADC_ZERO_UC_17_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_18 AFE_ADC_ZERO_UC_18
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_18_REG_DATA_POS          0 /**< UC_18_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_18_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_18_REG_DATA_POS)) /**< UC_18_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_18_REG_ADDR_POS          8 /**< UC_18_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_18_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_18_REG_ADDR_POS)) /**< UC_18_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_18_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_19 AFE_ADC_ZERO_UC_19
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_19_REG_DATA_POS          0 /**< UC_19_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_19_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_19_REG_DATA_POS)) /**< UC_19_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_19_REG_ADDR_POS          8 /**< UC_19_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_19_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_19_REG_ADDR_POS)) /**< UC_19_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_19_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_20 AFE_ADC_ZERO_UC_20
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_20_REG_DATA_POS          0 /**< UC_20_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_20_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_20_REG_DATA_POS)) /**< UC_20_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_20_REG_ADDR_POS          8 /**< UC_20_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_20_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_20_REG_ADDR_POS)) /**< UC_20_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_20_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_21 AFE_ADC_ZERO_UC_21
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_21_REG_DATA_POS          0 /**< UC_21_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_21_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_21_REG_DATA_POS)) /**< UC_21_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_21_REG_ADDR_POS          8 /**< UC_21_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_21_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_21_REG_ADDR_POS)) /**< UC_21_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_21_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_22 AFE_ADC_ZERO_UC_22
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_22_REG_DATA_POS          0 /**< UC_22_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_22_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_22_REG_DATA_POS)) /**< UC_22_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_22_REG_ADDR_POS          8 /**< UC_22_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_22_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_22_REG_ADDR_POS)) /**< UC_22_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_22_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_23 AFE_ADC_ZERO_UC_23
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_23_REG_DATA_POS          0 /**< UC_23_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_23_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_23_REG_DATA_POS)) /**< UC_23_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_23_REG_ADDR_POS          8 /**< UC_23_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_23_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_23_REG_ADDR_POS)) /**< UC_23_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_23_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_24 AFE_ADC_ZERO_UC_24
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_24_REG_DATA_POS          0 /**< UC_24_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_24_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_24_REG_DATA_POS)) /**< UC_24_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_24_REG_ADDR_POS          8 /**< UC_24_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_24_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_24_REG_ADDR_POS)) /**< UC_24_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_24_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_25 AFE_ADC_ZERO_UC_25
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_25_REG_DATA_POS          0 /**< UC_25_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_25_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_25_REG_DATA_POS)) /**< UC_25_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_25_REG_ADDR_POS          8 /**< UC_25_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_25_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_25_REG_ADDR_POS)) /**< UC_25_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_25_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_26 AFE_ADC_ZERO_UC_26
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_26_REG_DATA_POS          0 /**< UC_26_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_26_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_26_REG_DATA_POS)) /**< UC_26_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_26_REG_ADDR_POS          8 /**< UC_26_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_26_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_26_REG_ADDR_POS)) /**< UC_26_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_26_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_27 AFE_ADC_ZERO_UC_27
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_27_REG_DATA_POS          0 /**< UC_27_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_27_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_27_REG_DATA_POS)) /**< UC_27_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_27_REG_ADDR_POS          8 /**< UC_27_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_27_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_27_REG_ADDR_POS)) /**< UC_27_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_27_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_28 AFE_ADC_ZERO_UC_28
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_28_REG_DATA_POS          0 /**< UC_28_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_28_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_28_REG_DATA_POS)) /**< UC_28_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_28_REG_ADDR_POS          8 /**< UC_28_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_28_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_28_REG_ADDR_POS)) /**< UC_28_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_28_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_29 AFE_ADC_ZERO_UC_29
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_29_REG_DATA_POS          0 /**< UC_29_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_29_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_29_REG_DATA_POS)) /**< UC_29_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_29_REG_ADDR_POS          8 /**< UC_29_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_29_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_29_REG_ADDR_POS)) /**< UC_29_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_29_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_30 AFE_ADC_ZERO_UC_30
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_30_REG_DATA_POS          0 /**< UC_30_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_30_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_30_REG_DATA_POS)) /**< UC_30_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_30_REG_ADDR_POS          8 /**< UC_30_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_30_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_30_REG_ADDR_POS)) /**< UC_30_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_30_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_31 AFE_ADC_ZERO_UC_31
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_31_REG_DATA_POS          0 /**< UC_31_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_31_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_31_REG_DATA_POS)) /**< UC_31_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_31_REG_ADDR_POS          8 /**< UC_31_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_31_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_31_REG_ADDR_POS)) /**< UC_31_REG_ADDR Mask */

