analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32675/Include/afe_adc_zero_regs.h
/**@} end of group AFE_ADC_ZERO_UC_31_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_32 AFE_ADC_ZERO_UC_32
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_32_REG_DATA_POS          0 /**< UC_32_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_32_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_32_REG_DATA_POS)) /**< UC_32_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_32_REG_ADDR_POS          8 /**< UC_32_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_32_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_32_REG_ADDR_POS)) /**< UC_32_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_32_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_33 AFE_ADC_ZERO_UC_33
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_33_REG_DATA_POS          0 /**< UC_33_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_33_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_33_REG_DATA_POS)) /**< UC_33_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_33_REG_ADDR_POS          8 /**< UC_33_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_33_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_33_REG_ADDR_POS)) /**< UC_33_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_33_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_34 AFE_ADC_ZERO_UC_34
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_34_REG_DATA_POS          0 /**< UC_34_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_34_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_34_REG_DATA_POS)) /**< UC_34_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_34_REG_ADDR_POS          8 /**< UC_34_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_34_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_34_REG_ADDR_POS)) /**< UC_34_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_34_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_35 AFE_ADC_ZERO_UC_35
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_35_REG_DATA_POS          0 /**< UC_35_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_35_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_35_REG_DATA_POS)) /**< UC_35_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_35_REG_ADDR_POS          8 /**< UC_35_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_35_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_35_REG_ADDR_POS)) /**< UC_35_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_35_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_36 AFE_ADC_ZERO_UC_36
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_36_REG_DATA_POS          0 /**< UC_36_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_36_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_36_REG_DATA_POS)) /**< UC_36_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_36_REG_ADDR_POS          8 /**< UC_36_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_36_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_36_REG_ADDR_POS)) /**< UC_36_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_36_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_37 AFE_ADC_ZERO_UC_37
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_37_REG_DATA_POS          0 /**< UC_37_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_37_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_37_REG_DATA_POS)) /**< UC_37_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_37_REG_ADDR_POS          8 /**< UC_37_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_37_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_37_REG_ADDR_POS)) /**< UC_37_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_37_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_38 AFE_ADC_ZERO_UC_38
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_38_REG_DATA_POS          0 /**< UC_38_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_38_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_38_REG_DATA_POS)) /**< UC_38_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_38_REG_ADDR_POS          8 /**< UC_38_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_38_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_38_REG_ADDR_POS)) /**< UC_38_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_38_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_39 AFE_ADC_ZERO_UC_39
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_39_REG_DATA_POS          0 /**< UC_39_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_39_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_39_REG_DATA_POS)) /**< UC_39_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_39_REG_ADDR_POS          8 /**< UC_39_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_39_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_39_REG_ADDR_POS)) /**< UC_39_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_39_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_40 AFE_ADC_ZERO_UC_40
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_40_REG_DATA_POS          0 /**< UC_40_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_40_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_40_REG_DATA_POS)) /**< UC_40_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_40_REG_ADDR_POS          8 /**< UC_40_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_40_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_40_REG_ADDR_POS)) /**< UC_40_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_40_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_41 AFE_ADC_ZERO_UC_41
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_41_REG_DATA_POS          0 /**< UC_41_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_41_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_41_REG_DATA_POS)) /**< UC_41_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_41_REG_ADDR_POS          8 /**< UC_41_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_41_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_41_REG_ADDR_POS)) /**< UC_41_REG_ADDR Mask */

