analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32675/Include/afe_adc_zero_regs.h
/**@} end of group AFE_ADC_ZERO_UC_41_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_42 AFE_ADC_ZERO_UC_42
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_42_REG_DATA_POS          0 /**< UC_42_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_42_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_42_REG_DATA_POS)) /**< UC_42_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_42_REG_ADDR_POS          8 /**< UC_42_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_42_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_42_REG_ADDR_POS)) /**< UC_42_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_42_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_43 AFE_ADC_ZERO_UC_43
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_43_REG_DATA_POS          0 /**< UC_43_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_43_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_43_REG_DATA_POS)) /**< UC_43_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_43_REG_ADDR_POS          8 /**< UC_43_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_43_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_43_REG_ADDR_POS)) /**< UC_43_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_43_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_44 AFE_ADC_ZERO_UC_44
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_44_REG_DATA_POS          0 /**< UC_44_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_44_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_44_REG_DATA_POS)) /**< UC_44_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_44_REG_ADDR_POS          8 /**< UC_44_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_44_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_44_REG_ADDR_POS)) /**< UC_44_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_44_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_45 AFE_ADC_ZERO_UC_45
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_45_REG_DATA_POS          0 /**< UC_45_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_45_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_45_REG_DATA_POS)) /**< UC_45_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_45_REG_ADDR_POS          8 /**< UC_45_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_45_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_45_REG_ADDR_POS)) /**< UC_45_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_45_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_46 AFE_ADC_ZERO_UC_46
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_46_REG_DATA_POS          0 /**< UC_46_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_46_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_46_REG_DATA_POS)) /**< UC_46_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_46_REG_ADDR_POS          8 /**< UC_46_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_46_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_46_REG_ADDR_POS)) /**< UC_46_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_46_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_47 AFE_ADC_ZERO_UC_47
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_47_REG_DATA_POS          0 /**< UC_47_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_47_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_47_REG_DATA_POS)) /**< UC_47_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_47_REG_ADDR_POS          8 /**< UC_47_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_47_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_47_REG_ADDR_POS)) /**< UC_47_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_47_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_48 AFE_ADC_ZERO_UC_48
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_48_REG_DATA_POS          0 /**< UC_48_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_48_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_48_REG_DATA_POS)) /**< UC_48_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_48_REG_ADDR_POS          8 /**< UC_48_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_48_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_48_REG_ADDR_POS)) /**< UC_48_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_48_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_49 AFE_ADC_ZERO_UC_49
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_49_REG_DATA_POS          0 /**< UC_49_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_49_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_49_REG_DATA_POS)) /**< UC_49_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_49_REG_ADDR_POS          8 /**< UC_49_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_49_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_49_REG_ADDR_POS)) /**< UC_49_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_49_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_50 AFE_ADC_ZERO_UC_50
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_50_REG_DATA_POS          0 /**< UC_50_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_50_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_50_REG_DATA_POS)) /**< UC_50_REG_DATA Mask */

#define MXC_F_AFE_ADC_ZERO_UC_50_REG_ADDR_POS          8 /**< UC_50_REG_ADDR Position */
#define MXC_F_AFE_ADC_ZERO_UC_50_REG_ADDR              ((uint16_t)(0x7FUL << MXC_F_AFE_ADC_ZERO_UC_50_REG_ADDR_POS)) /**< UC_50_REG_ADDR Mask */

/**@} end of group AFE_ADC_ZERO_UC_50_Register */

/**
 * @ingroup  afe_adc_zero_registers
 * @defgroup AFE_ADC_ZERO_UC_51 AFE_ADC_ZERO_UC_51
 * @brief    Sequencer Register
 * @{
 */
#define MXC_F_AFE_ADC_ZERO_UC_51_REG_DATA_POS          0 /**< UC_51_REG_DATA Position */
#define MXC_F_AFE_ADC_ZERO_UC_51_REG_DATA              ((uint16_t)(0xFFUL << MXC_F_AFE_ADC_ZERO_UC_51_REG_DATA_POS)) /**< UC_51_REG_DATA Mask */

